Sure. Below is the plan with Terraform outputs. For our use case, we are testing the ALZ accelerator in our development directory before deploying it to the production directory. To do this, we need to customize the service tier to the minimum level possible in order to save cost. We will switch to a higher tier once we are comfortable deploying the ALZ in our production directory.

```
 module.virtual_wan[0].module.firewall_policy["primary"].azurerm_firewall_policy.this will be created
  + resource "azurerm_firewall_policy" "this" {
      + child_policies           = (known after apply)
      + firewalls                = (known after apply)
      + id                       = (known after apply)
      + location                 = "southeastasia"
      + name                     = "fwp-hub-southeastasia"
      + resource_group_name      = "rg-hub-southeastasia"
      + rule_collection_groups   = (known after apply)
      + sku                      = "Basic"
      + threat_intelligence_mode = "Alert"

      + dns {
          + proxy_enabled = false
          + servers       = []
        }
    }

  # module.virtual_wan[0].module.virtual_wan.module.firewalls.azurerm_firewall.fw["primary"] will be created
  + resource "azurerm_firewall" "fw" {
      + dns_proxy_enabled   = (known after apply)
      + firewall_policy_id  = (known after apply)
      + id                  = (known after apply)
      + location            = "southeastasia"
      + name                = "fw-hub-southeastasia"
      + resource_group_name = "rg-hub-southeastasia"
      + sku_name            = "AZFW_Hub"
      + sku_tier            = "Basic"
      + threat_intel_mode   = (known after apply)

      + virtual_hub {
          + private_ip_address  = (known after apply)
          + public_ip_addresses = (known after apply)
          + public_ip_count     = 1
          + virtual_hub_id      = "/subscriptions/xxxxxx/resourceGroups/rg-hub-southeastasia/providers/Microsoft.Network/virtualHubs/vwan-hub-southeastasia"
        }
    }
```